[
  {
    "facebookUrl": "https://www.facebook.com/profile.php?id=61573173656596&sk=reviews",
    "text": "We can’t recommend Joanne’s Driving School highly enough. Our son passed his driving test first time, and that’s largely down to Joanne’s brilliant teaching. She’s extremely reliable, calm and supportive, and creates a really chilled, relaxed learning environment. Our son speaks very highly of her and always felt comfortable and at ease during lessons – she’s easy to talk to and explains things clearly. Thank you, Joanne",
    "date": "2026-01-21T20:25:37.000Z",
    "likesCount": 2,
    "commentsCount": 0,
    "isRecommended": true
  },
  {
    "facebookUrl": "https://www.facebook.com/profile.php?id=61573173656596&sk=reviews",
    "text": "I highly recommend Joanne I thought I learnt very fast and I felt safe driving with her. I was driving around town on my first lesson and didn’t get held back at all. Thanks for everything.",
    "date": "2026-01-21T16:19:52.000Z",
    "likesCount": 2,
    "commentsCount": 0,
    "isRecommended": true
  },
  {
    "facebookUrl": "https://www.facebook.com/profile.php?id=61573173656596&sk=reviews",
    "text": "I can't recommend Joannes Driving school enough. She has built my confidence for driving and has made me excel throughout the experience, thank you Joanne for helping me achieve a First time pass 😁🚗",
    "date": "2025-12-15T11:20:54.000Z",
    "likesCount": 2,
    "commentsCount": 0,
    "isRecommended": true
  },
  {
    "facebookUrl": "https://www.facebook.com/profile.php?id=61573173656596&sk=reviews",
    "text": "I had a great learning experience with Jo, she always made me feel comfortable. Her calm, supportive teaching style made everything easy to understand and really helped build my confidence, she is a great instructor and made lessons very enjoyable, i would 100% recommend her to anyone who is looking to learn to drive!",
    "date": "2025-12-08T18:22:48.000Z",
    "likesCount": 1,
    "commentsCount": 0,
    "isRecommended": true
  },
  {
    "facebookUrl": "https://www.facebook.com/profile.php?id=61573173656596&sk=reviews",
    "text": "Jo is an excellent driving instructor, I previously learnt with another instructor. I hadn’t felt that I could drive after so many lessons but once I started with Jo I was able to become a great driver and pass my test. I felt relaxed and at ease and was able to learn everything very well through Jo’s Teaching",
    "date": "2025-11-27T10:51:29.000Z",
    "likesCount": 1,
    "commentsCount": 0,
    "isRecommended": true
  },
  {
    "facebookUrl": "https://www.facebook.com/profile.php?id=61573173656596&sk=reviews",
    "text": "Best driving instructor ever. Able to keep professionalism at a high standard whilst being able to have a laugh. Incredible demonstrations and very clear explanations. If you wanna pass, pass with Joanne (the best in the business).",
    "date": "2025-09-26T15:03:30.000Z",
    "likesCount": 1,
    "commentsCount": 0,
    "isRecommended": true
  },
  {
    "facebookUrl": "https://www.facebook.com/profile.php?id=61573173656596&sk=reviews",
    "text": "Jo is actually an incredible instructor. She is  so kind, calm and patient. She makes you feel so comfortable behind the wheel even in the most stressful lessons. Such a brilliant instructor to learn from and wouldn’t have passed without her. \n⭐️⭐️⭐️⭐️⭐️",
    "date": "2025-09-21T09:32:58.000Z",
    "likesCount": 1,
    "commentsCount": 0,
    "isRecommended": true
  },
  {
    "facebookUrl": "https://www.facebook.com/profile.php?id=61573173656596&sk=reviews",
    "text": "Learning to drive with Jo has honestly been the best experience! She is attentive and patient and really knows how to work through any type of issue you incur whilst learning to drive. She recognises issues you are having and faces them head on and adapts your learning plan to overcome them. I would 1000% recommend Jo as a driving instructor. She is just simply awesome ❤️",
    "date": "2025-09-19T17:31:08.000Z",
    "likesCount": 1,
    "commentsCount": 0,
    "isRecommended": true
  },
  {
    "facebookUrl": "https://www.facebook.com/profile.php?id=61573173656596&sk=reviews",
    "text": "Learning to drive can be nerve-wracking, but Jo made the whole experience so much easier and more enjoyable. She’s absolutely amazing — patient, supportive, and always made me feel at ease behind the wheel. Her calm and friendly approach really helped build my confidence, and she explained everything in a way that made sense. I genuinely looked forward to each lesson!\n\nIf you’re looking for an instructor who truly cares and wants you to succeed, I can’t recommend Jo enough. Thank you for everything, Jo!",
    "date": "2025-07-30T13:30:46.000Z",
    "likesCount": 2,
    "commentsCount": 0,
    "isRecommended": true
  },
  {
    "facebookUrl": "https://www.facebook.com/profile.php?id=61573173656596&sk=reviews",
    "text": "I passed my test today and couldn’t have done it without Jo! She is the most lovely and trusting driving instructor i could’ve asked for!! From the first lesson she made me feel so confident and calm behind the wheel! Not only is she the best driving instructor she is also the nicest person and we could always have a laugh and chat! Thankyou so much Jo couldn’t have done it without you! 🥰",
    "date": "2025-07-11T14:50:26.000Z",
    "likesCount": 1,
    "commentsCount": 0,
    "isRecommended": true
  },
  {
    "facebookUrl": "https://www.facebook.com/profile.php?id=61573173656596&sk=reviews",
    "text": "⭐️⭐️⭐️⭐️⭐️\n\nI honestly couldn't have asked for a better driving instructor than Jo! From the very first lesson, she made me feel completely at ease and confident behind the wheel. Her calm, supportive teaching style really helped me stay focused and relaxed — and thanks to her, I passed first time with zero minors!\n\nJo is not only an incredible instructor but also such a genuinely lovely person. We always had a good gossip and a laugh during lessons, which made learning to drive so much more fun. I looked forward to our lessons every week!\n\nIf you're looking for someone who’s patient, knowledgeable, and just all-round amazing to learn with — Jo is your girl. I’m so grateful for everything she’s done for me.\n\nSo get on the go with Jo!",
    "date": "2025-07-07T15:49:24.000Z",
    "likesCount": 1,
    "commentsCount": 0,
    "isRecommended": true
  },
  {
    "facebookUrl": "https://www.facebook.com/profile.php?id=61573173656596&sk=reviews",
    "text": "I had previous driving experience before Covid, however I had lost my confidence as I hadn’t driven for many years. Jo made me feel very confident and gave me my love for driving back. I passed my test today and Jo got me very prepared which I am forever grateful for.  I would highly recommend going with Jo!",
    "date": "2025-04-29T10:21:11.000Z",
    "likesCount": 1,
    "commentsCount": 0,
    "isRecommended": true
  },
  {
    "facebookUrl": "https://www.facebook.com/profile.php?id=61573173656596&sk=reviews",
    "text": "⭐️⭐️⭐️⭐️⭐️ Absolutely Fantastic Driving Instructor!\n\nI couldn’t have asked for a better driving instructor! Joanne is incredibly patient, knowledgeable, and supportive. From day one, she made me feel comfortable behind the wheel, explaining everything clearly and tailoring lessons to suit my learning style.\n\nHer calm and encouraging approach gave me the confidence I needed, and thanks to her expert guidance, I passed my test with flying colors! Go with Jo.",
    "date": "2025-03-11T15:39:04.000Z",
    "likesCount": 2,
    "commentsCount": 0,
    "isRecommended": true
  }
]